LuanContacts/app/controllers/api/v1/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Luan "], ["email", "luan@gmail.com"], ["user_id", 2], ["created_at", "2019-08-27 20:36:04.135084"], ["updated_at", "2019-08-27 20:36:04.135084"]]
---
 def create
   @contact = Contact.new(contact_params.merge(user: current_user))
   if @contact.save

UPDATE "contacts" SET "name" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "Luan Linares"], ["updated_at", "2019-08-27 20:48:42.318131"], ["id", 2]]
---
 def update
   if @contact.update(contact_params)

DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]
---
 def destroy
   @contact.destroy

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def set_contact
     @contact = Contact.find(params[:id])